import 'package:flutter_projects/src/models/doctor.dart';
import 'package:flutter_projects/src/models/rate.dart';
import 'package:flutter_projects/src/models/user.dart';

import 'assets.dart';

var currentUser = User(
  email: 'ahmed01289017198@gmail.com',
  gender: 'male',
  imageUrl: '',
  isOnline: true,
  name: 'ahmed essam',
  phoneNumber: '01289017198',
);

var _normalUser = [
  User(
    email: 'ahmed01289017198@gmail.com',
    gender: 'male',
    imageUrl: Assets.user(1),
    isOnline: true,
    name: 'احمد محمود',
    phoneNumber: '01289017198',
  ),
  User(
    email: 'ahmed01289017198@gmail.com',
    gender: 'male',
    imageUrl: Assets.user(2),
    isOnline: true,
    name: 'سميث محمود',
    phoneNumber: '01289017198',
  ),
  User(
    email: 'ahmed01289017198@gmail.com',
    gender: 'male',
    imageUrl: Assets.user(3),
    isOnline: true,
    name: 'مينا محمود',
    phoneNumber: '01289017198',
  ),
];

var _doctorData = [
  User(
    email: 'ahmed01289017198@gmail.com',
    gender: 'female',
    imageUrl: Assets.doctor(1),
    isOnline: true,
    name: 'د. ايمان السيد',
    phoneNumber: '01289017198',
  ),
  User(
    email: 'ahmed01289017198@gmail.com',
    gender: 'male',
    imageUrl: Assets.doctor(2),
    isOnline: true,
    name: 'د. يوسف يوشع',
    phoneNumber: '01289017198',
  ),
  User(
    email: 'ahmed01289017198@gmail.com',
    gender: 'female',
    imageUrl: Assets.doctor(3),
    isOnline: true,
    name: 'د. جويل عقاري',
    phoneNumber: '01289017198',
  ),
  User(
    email: 'ahmed01289017198@gmail.com',
    gender: 'male',
    imageUrl: Assets.doctor(4),
    isOnline: true,
    name: 'د. ادم محمود',
    phoneNumber: '01289017198',
  ),
  User(
    email: 'ahmed01289017198@gmail.com',
    gender: 'male',
    imageUrl: Assets.doctor(5),
    isOnline: true,
    name: 'د. محمد محمود',
    phoneNumber: '01289017198',
  ),
  User(
    email: 'ahmed01289017198@gmail.com',
    gender: 'male',
    imageUrl: Assets.doctor(6),
    isOnline: true,
    name: 'د. مازن محمد',
    phoneNumber: '01289017198',
  ),
  User(
    email: 'ahmed01289017198@gmail.com',
    gender: 'male',
    imageUrl: Assets.doctor(7),
    isOnline: true,
    name: 'د. عباس السيد',
    phoneNumber: '01289017198',
  ),
  User(
    email: 'ahmed01289017198@gmail.com',
    gender: 'female',
    imageUrl: Assets.doctor(8),
    isOnline: true,
    name: 'د. اسراد محمد',
    phoneNumber: '01289017198',
  ),
  User(
    email: 'ahmed01289017198@gmail.com',
    gender: 'female',
    imageUrl: Assets.doctor(9),
    isOnline: true,
    name: 'د. اسماء احمد',
    phoneNumber: '01289017198',
  ),
  User(
    email: 'ahmed01289017198@gmail.com',
    gender: 'male',
    imageUrl: Assets.doctor(10),
    isOnline: true,
    name: 'د. طارق حمدي',
    phoneNumber: '01289017198',
  ),
];

var doctors = [
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[0],
    price: 100,
    language: 'ar',
    offerPrice: 90,
    rate: 3,
    special: 'دكتوراه العلاج النفسي',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[1],
    price: 85,
    language: 'ar',
    offerPrice: 60,
    rate: 4,
    special: 'اخصائي نفسي',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[2],
    price: 65,
    language: 'ar',
    offerPrice: 50,
    rate: 5,
    special: 'اخصائي علاج نطق ولغه',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[4],
    price: 84,
    language: 'en',
    offerPrice: 80,
    rate: 5,
    special: 'عظام',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[3],
    price: 65,
    language: 'ar',
    offerPrice: 60,
    rate: 4,
    special: 'رمد وضعف نظر',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[6],
    price: 40,
    language: 'ar',
    offerPrice: 35,
    rate: 4,
    special: 'دكتوراه انف اذن وحنجره',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[5],
    price: 75,
    language: 'en',
    offerPrice: 70,
    rate: 3,
    special: 'دكتوراه في الاعصاب',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[7],
    price: 62,
    language: 'ar',
    offerPrice: 50,
    rate: 4,
    special: 'دكتوراه العلاج النفسي',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[8],
    price: 89,
    language: 'ar',
    offerPrice: 80,
    rate: 3,
    special: 'اخصائي نفسي',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[9],
    price: 98,
    language: 'ar',
    offerPrice: 90,
    rate: 3,
    special: 'اخصائي علاج نطق ولغه',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[0],
    price: 100,
    language: 'ar',
    offerPrice: 90,
    rate: 5,
    special: 'دكتوراه العلاج النفسي',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[1],
    price: 85,
    language: 'ar',
    offerPrice: 60,
    rate: 4,
    special: 'اخصائي نفسي',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[2],
    price: 65,
    language: 'ar',
    offerPrice: 50,
    rate: 5,
    special: 'اخصائي علاج نطق ولغه',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[4],
    price: 84,
    language: 'en',
    offerPrice: 80,
    rate: 5,
    special: 'عظام',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[3],
    price: 65,
    language: 'ar',
    offerPrice: 60,
    rate: 4,
    special: 'رمد وضعف نظر',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[6],
    price: 40,
    language: 'ar',
    offerPrice: 35,
    rate: 4,
    special: 'دكتوراه انف اذن وحنجره',
  ),
  Doctor(
    education: '''
التعليم:
حاصل على شهادة البكالورويس من جامعة اكسفورد
حاصل على شهادة الماجستير من جامعة لندن
حاصل على شهادة الدكتوراه من جامعة لندن
الخبرات:
خبرة  ٣سنوات في العلاج النفسي في مستشفى الأمل
حاصل على عدة جوائز عالمية في مجال الطب النفسي
حاصل على العديد من الدورات الدولية''',
    bio: '''
أرشاد الأهل  تقوية الثقة بالنفس  الاكتئاب العمل على حب
الذات  مشاكل الانفصال  الخجل الأجتماعي  اضطرابات القلق 
اضطراب الوسواس القهري  اضطراب كرب ما بعد الصدمة 
اضطراب قلق الفراق، القلق العام الرهاب الاجتماعي  الإدمان 
الفصام  اضطرابات المزاج  الاضطراب الوجداني ثنائي القطب''',
    numberOfUserRated: 12,
    usersRate: _comments,
    user: _doctorData[5],
    price: 75,
    language: 'en',
    offerPrice: 70,
    rate: 3,
    special: 'دكتوراه في الاعصاب',
  ),
];

var _comments = [
  Rate(
      user: _normalUser[0],
      rate: 4,
      comment: '''هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة،
لقد تم توليد هذا النص من مولد النص العربى'''),
  Rate(
      user: _normalUser[1],
      rate: 3,
      comment: '''هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة،
لقد تم توليد هذا النص من مولد النص العربى'''),
  Rate(
      user: _normalUser[2],
      rate: 5,
      comment: '''هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة،
لقد تم توليد هذا النص من مولد النص العربى'''),
];
